{
  "blogs": [
    {
      "id": 3,
      "title": "“学完就忘”如何解决？",
      "author": "弗兰克扬",
      "body": "第一个关键点：与学习内容相匹配的高质量测试为什么学完一个知识或技能后，要马上去做一些很匹配的练习题？ 一方面是检验自己是否真的学会了。 这一点很重要，我们时常会有一种错觉，就是看着正确答案的时候，觉得自己会了，都懂了，然后一考试就完全忘掉了。 这往往是因为当初就没学会，只不过是自己以为自己学会了而已。 所以，一定要用最真实的环境去测试一下自己是否真的学会了，记住了。 另一方面则是，我们在学习任何新事物的时候，都需要足够的正反馈，这些正反馈才能激励自己不断地坚持下去。 所以，如果你学习一个东西，没有足够多的相匹配的练习题去时刻检测自己，给自己带来正反馈的话，那这个学习，很可能是一个你自己一厢情愿的伪学习过程，也就是我们常说的，假装在努力。 当你在学习一项新技能的时候，可以很自然而然地有寻找高质量测试的习惯的时候，你的学习质量就已经提高了很多倍了。 第二个关键点：短期，大量，重复 这是我当年读大学，准备GRE考试的时候悟出的一个简单粗暴但却很有用的经验。 那时候学习GRE第一个最大的障碍就是单词，因为GRE的词汇量太大了，这一点从单词书的厚度上就能看得出来了，尤其是对于一个刚读本科的学生，里面有大量的学术词汇，很难记忆。 我记得一开始背单词的时候，最痛苦的事就是两个多小时才能真的背完一个list的一百多个单词，那时候我给自己的最低任务是一天要背3个list，然后再把前两天背的复习一遍。 但是我一开始复习的时候，发现我前两天花了几个小时才背会的单词，过两天再背，就和背新的一样，完全没有印象。 这是一开始最艰难的时候，也是很多人最容易放弃的时候。 当时也是学习到了艾宾浩斯遗忘曲线，然后根据一些现在的人实战出来的记忆周期，安排了学习新内容和复习内容的节奏，基本上就是新学习的内容每隔一天，三天，七天和十天再次复习一遍。 使用艾宾浩斯遗忘曲线的关键点在于，领略其方法的精髓，而不是到处求一张别人列好的学习日程表去照着做。 原因也很简单，每个人的情况不一样，对应的学习和复习节奏也是不一样的。 这样你就可以把学习的过程转化为一个慢慢摸索的过程，摸索自己到底每隔多长时间就会遗忘多少比例的内容，最后就能优化出一个最佳的学习和复习节奏。 这时候，每当你发现，你又没记住一部分内容的时候，你的反应不应该是产生一堆自己怎么又忘了，自己怎么这么笨的负面情绪，而是客观地记录自己遗忘了哪些，记住了哪些，以及根据这些数据，自己应该如何安排之后复习的节奏。 我自己在攻克掉GRE词汇关之后，又用了同样的方法攻克掉了阅读关，我的心得就是，你要学习会一样新东西，最关键的就是避免把战线拖得太长，一定要在精力允许的情况下，尽快解决战斗。 这就需要你每天的学习和复习任务都尽量塞到最高值。 这时候可以把精力注重在量的完成度上，而不必在意所谓的“学习质量”。 一个东西学习了几遍，每次都是过几天就忘了，没关系，重要的是，你今天又重复了一遍。 只要你能在短时间内尽可能多地重复这些核心内容，在经过了一定量的积累之后，你终将会看到量变产生质变的那一刻的到来。 这乍一看好像很没道理，到学习东西就是这样，真正的学会在于你形成一种“肌肉记忆”，所以你发现无论是学习一项体育运动技能，还是学习知识，最终都是要形成正确的“肌肉记忆”，而这其中的关键就是我领悟到的，简单粗暴而又极其准确的“短期，大量，重复”！ 好用的东西，往往不需要那么复杂的道理，更不需要你花多少时间才能听懂，最重要的是你真的去实践了。 "
    },
    {
      "id": 4,
      "title": "幸福来自效率的全面复合增长",
      "author": "王川",
      "body": "1/ 小孩子之所以看上去很幸福，一是因为五六岁之前，心智还在初始阶段的时候，对未来没有任何概念，完全活在当下。活在当下就意味着没有烦恼，可以沉浸在一些简单的事情上没心没肺的玩大半天。但前提是上面有成年人可以罩着，帮他防范潜在的风险和伤害。 2/ 五六岁到十八岁之间，会不断接触各种新东西，新概念，新朋友。对于一个心智简单的个体而言，每天都是新的一天，可以足够满足自己的好奇心，可以学到新的东西，所以仍然是快乐的，对未来充满憧憬和期盼的感觉。但这种快乐随着年龄增长，和应试教育的压力增加，而不断衰减。 3/ 即使是物理条件不好，家庭穷困，但至少十八岁之前还在长个子，只要还在成长，不管是哪个维度，成长本身，就是让人有幸福的理由。 4/ 但过了 25岁之后，绝大多数人就不可能长个头了。很多人也基本不去长知识了。信息的接触面，社交的接触面，日常活动的范围也就基本停滞不前，结婚生子意味着各种要负担的责任压力增加，休闲时间迅速减少，这就是幸福感开始迅速萎缩的转折点了。然后很多人永远无法摆脱此泥潭，只能骂骂咧咧，长吁短叹，怨天尤人。 5/ “幸福既不是美德，也不是快乐，既不是这一个事情，也不是那一个事情。幸福本质就是成长。我们在成长的时候，就会觉得幸福。” 此话出自爱尔兰诗人，1923年诺贝尔文学奖获得者 William Butler Yeats ( 1865-1939) 6/ 最大的幸福，就是全面的，长期的，有机的，可持续的复合增长。增长的时候，你自然的有幸福感，而不会把这个东西当作虚幻的哲学议题。一个多维度持续增长的人，都没时间去意识到幸福是个值得讨论的议题。如果你还要和人反复讨论什么是幸福，那基本可以确定，你在任何维度都没有可观的增长。 7/ 快乐 (pleasure) 和幸福 (happiness) 的底层生理机制不一样。前者主要通过多巴胺和多巴胺受体的结合，让神经元激发。但刺激越多，多巴胺受体越少，未来就需要更多的多巴胺才能带来快感和动力。最后形成依赖和上瘾。频繁进食导致的肥胖，不顾风险加杠杆频繁交易，和吸毒上瘾，都是类似机制。 8/ 吃喝玩乐这种事情，虽然愉快，但是做多了好像总觉得哪个地方不对。本质在于事情结束之后，你的能量和信息效率并未提高，你不会说原来一个馒头就饱，现在半个馒头就够了。你吸收利用葡萄糖的效率没有半点提高。你洞穿问题本质的能力并未提高。快乐爽一时，但如果人没有实质性进步，结束之后仍然空虚。 9/ 如果通过持续努力，获得了某个维度的真正的若干倍的效率提高，虽然过程有些艰辛，但这是真正的幸福，你会发现因为效率的提高，你的资源富余度更高了，有更多冗余，以前做不了的事情，易如反掌。你可以探索的空间和时间范围都更大了，你满怀期待，努力寻求进一步的效率提高。 10/ 这就是快乐和幸福的一个本质区别。而再回顾当年效率低下时的状态时，感觉就是纯傻*。 11/ 效率提高可有多种形式: 以前互联网宽带接入速度是 100 MB, 现在可到 1G ; 以前有什么思考只能传送给几百人，现在一篇文字可以让几万人几十万人看到，获得意想不到的反馈和启发; 以前遇到困难问题钻牛角尖半天搞不定暴跳如雷，现在在网上搜，朋友圈里吆喝一下，很快找到若干替代方案，几分钟搞定。 12/ 有效积累的本质，是可以在此基础上带来多维度的复合增长。多年前的做的一件事，养成的一个好习惯，现在仍然可以受益。比如一个地方把路修好了，运输费用降下来了，商品成本价格也下来了，来往车辆的损耗也降下来，因此使用寿命更长，等等。美国农业生产效率之所以世界上最高，农业人口占总人口比例不到 1.5%， 根本原因就是这种多维度全方位的复杂体系的两百多年来的长期积累。 13/ 打工者的最大困境，在于其大部分努力最多只能换来老板廉价的夸奖，和一些不断贬值的法币，而无法产生终生受益的效率上的有效积累。然后每次换工作时又要清零重来一遍。所谓中年危机就是找不到增长点了，也不知道如何真正有机的增长，想拆东墙补西墙寻求表面的增长，反而在泥潭里越陷越深。 14/ 所以要获得幸福感，一定要系统科学的寻找可持续的新的增长点，尤其是财富，闲暇时间和知识的增长。但这世界上有很多信息迷雾和骗局，很多外表上的增长点，进去之后发现是一场空，甚至把以前的积蓄都亏掉。这是客观现实，面对这个困难的现实没有简单的药到病除的捷径， 只能依靠长时间踏踏实实的积累，才能超越。 15/ 从信息输入成本和效率上看，当今世界上，再也没有比大量持续读书 (总量要上千)，读各个领域行业的书，读各种便携的电子书，成本更低，能够更快的识别陷阱，摆脱泥潭，寻找获取新增长点的方法了。 16/ 从输出成本和效率上看， 写作（包括写代码）是提高效率的一个好方法。比如你以前写一个东西，只有一百人看，现在可以有一百万人看，效率提高了一万倍。但如何做到有更多人看呢？一个技巧是不要去讨论表面的肤浅的现象 (比如价格波动)，而是要深挖研究底层机制。表象的东西几天后就过时了，但如果把底层机制真正搞清楚，它还会重复无数次。 17/ 提高效率第二个方法是一定要坚持构建自己的品牌。品牌本质是个无形的网络，和这个网络挂钩的作品都会容易推广，一荣俱荣，极大提高传播效率，而且会不断积累叠加。很多人在微博或推特上注册一个莫名其妙的没有品牌的网名，一旦号被封了，以前的创作全都没了，功夫全白费了，也不会有人记得他们是谁了。甲壳虫主唱 John Lennon 遗孀小野洋子 (1933-) 每年继承其版税收入大概有一千两百万美元，这就是真正的品牌带来的高效率和躺赢。 18/ 提高效率的第三点是不断寻找新的渠道方法，增加自己的作品产品的可组合性。每一次新的组合，被外界所利用，对于原创者都是摊薄成本，拓展接触空间的助推器，对虚拟化的产品尤其如此。而且这种组合的方式原创者往往无法预测。要始终坚持与通用性最广的连接模式兼容，和组合性最强的网络不断连接。英国音乐家 Ed Sheeran 的 “Shape of you” 从 2017年到2020年一月在 spotify 上播放了二十三亿次，每次播放 spotify 给他支付 0.0034 英镑的版税收入，累积收入已经过七百万英镑。这首单曲大火的一个原因是它是 Sheeran 的第一首适合舞蹈的歌曲，油管上有多个以其配乐的舞蹈录像，动辄上亿点击率。 19/ 一般人们只能理解自己的劳动成果在可触及的领域的马上的应用，但是如果把自己的通用性高的作品或服务，连接到组合性最高的网络上时，可衍生出来的你无法想象的组合性应用，没有任何上限。这类创作的潜在价值，长期看始终会被低估。”身后是非谁管得，满村听说蔡中郎” 用现代语言翻译，就是说某个作品的未来的价值，原创者自己也无法评估。所以要多思考解决通用性高的问题，不断和组合性高的网络建立连接。 20/ 还有一种更微妙的效率提高，可以称其为“认知效率”。比如说以前面对这个复杂变化的世界，疑惑而不得要领。认知效率提高后，见到某某人**一撅，就知道要拉什么；见到一个人高歌猛进猛加杠杆，就可以预见其未来的爆仓；见到某个人欲盖弥彰的宣传什么，就可以推测他缺什么；见到某人的一意孤行，就可以预见未来他和无数南墙的碰撞；见到细微的信号，就可以更迅速的提前感知形势的发展。 21/ 关于“认知效率”的几点经验: 朋友如果对你态度冷淡敷衍，他对你没有兴趣，不要一厢情愿，自作多情。 很多时候，看一个人或几个人之间，没说什么话，没做什么事，推导出的信息量，要大于他表面上说的什么话，做的什么事。表面上的很多事情都是假象，用来误导外人的。 如果你看到某个地方存在造假，那么你没看到的地方的造假规模，可能要至少高一个数量级。 理解了自己的阴暗面，就可以更好的理解别人的阴暗面 (原话来自瑞士心理学家荣格 )。 尽管如此，大部分人还是习惯性一厢情愿，被表面假象误导，低估造假的规模，总想把别人当傻瓜(而低估外人的阴暗面)。 22/ 最终，和一大群可以信赖的分布式网络节点，快速，安全，全面的共享信息并且协作，是节约成本，极大提高效率的核心策略。是智人最终超越其它生物，主宰地球的演化路径。”共享信息和协作”本质是软件技术，看上去没有大块吃肉，大碗喝酒，或者舞枪弄棒那么性感，但可以让网络上的单个服务模块被最大限度的重复使用，层层叠加，成为决定胜负优劣的关键。这也是为什么亚马逊有很多二流技术人员，但仍然做出一流公司的核心原因。 23/ 这种”共享信息和协作”不仅在人和人之间，也体现在许多其它层面。比如智人的大脑里的 multimodal association cortex (多模整合皮质层) 可以把把各个维度角度的信息，综合起来。大脑缺乏综合能力的一个例子，比如说看到某张人脸的照片，能够理解这是人脸，但是无法和某个具体的人联系在一起，就无法迅速判断这是机会还是威胁，这样在长期的生存竞争中因为效率低下，而注定会被淘汰。 24/ 效率的复合增长没有上限，幸福亦无上限。"
    },
    {
      "id": 6,
      "title": "如何处理迷茫？",
      "author": "弗兰克扬",
      "body": "许多人都会有这样类型的问题，那就是你在追求一个目标，看起来能说出来挺多合理的理由的，但是这种理由却经不起更深入的推敲和反问。 因为这些追求的理由很多是周围人或者说世俗强加给你的，只不过没有经过你自己的思索，你就全盘接受了，好像那就是你自己的追求一样，比如考个名牌大学，找份金牌工作，挣一份顶级薪水，买一套超级学区房等等。 为了这些眼前的目标，你什么都可以牺牲，可以牺牲娱乐的时间，（OK，你觉得别人在玩的时候你在奋斗，很充实！）可以牺牲谈恋爱的时间，（OK，你觉得为了目标很值得）可以牺牲陪伴家人的时间（OK，你觉得这也是为了他们好，将来可以更好地报答他们）可以牺牲健康，（OK，你觉得人在年轻的时候就要有那么几个为了理想不顾一切的时刻）可以…… 一直到你一再受挫，一再牺牲，一再付出，最后到了再也无法承受的边缘，你才猛然发现，自己这么做到底是为了什么啊，这个目标对于自己来说真的就那么重要吗？为了这个目标被牺牲掉那么多东西都很值得吗？ 不是说世俗的成功不重要，不值得追求，而是世俗定义的成功太多了，你显然不可能全部都得到，即使你含着金汤匙出生，亦或是天赋异禀，也都会有所取舍，一切都是权衡，一切都是tradeoff。 我之后的故事在其他的文章里都说过无数次了，总之应该在一开始想明白的基本问题，我没有去想，而是被动接受了一个外部环境给我定义的目标，导致我之后十年才慢慢从这种错误的困境里走出来，让我觉得这是命运赠送给我的一个礼物，让我在二十多岁的年纪里有了一段这么痛的领悟。 所以，你可以选择考研，你甚至都可以为了一个牌子，走那条我批判过的道路，选择天坑专业，考研，因为报录比十分低，所以你可以花一个很低的代价就刷到一个985，甚至清北的硕士学历。 但是，你要清楚，这个学历对你来说意味着什么？你拿到这个学位之后要去做什么，而不是暂时不知道干什么，拿一个清北的硕士学位至少看起来很不错，对周围人都是一个交代，对自己也应该是一个交代，于是就稀里糊涂去考研，去读了，读完就顺水推舟进入了相关行业得过且过着。 亲爱的，你不需要给任何人一个交代，你也不需要向周围的任何一个人解释你为什么要做这个选择，不要在意他们的目光，他们又不会为你的选择错误买单，自己人生的选择只能自己买单，所以，你要说服你自己，理清你自己做出这个选择的最深层次的逻辑，这个逻辑或者说这个信念足以让你在未来遇到任何挫折时都会坚定自己的选择，不会怀疑自己，以后也不会后悔，这样才算真正地给自己有一个交待。 比如，你想进入XX行业，XX行业很看重学历，但是你的本科出身已经无法改变，但是你发现XX行业的一些二流机构是接受本科一般，硕士名校的人的，而且不太看重专业，那么你就可以选一个清北最冷门的专业，最好考的专业，刷学历的同时准备进入那一个行业的技能，去实习，去面试，最终进入那个门槛。 你可以暂时不用想那个行业到底是不是你最喜欢的，因为你没亲身进去之前你并不能知道自己是否真的喜欢，但是你可以把进入那个行业作为你去刷学历的信念支撑，这样你在面临考研压力，毕业前实验挫折的时候，你都可以说服自己，你这么做全都是为了那一纸文凭，因为有了这个你才能进入那个行业。 至于那个行业是不是你毕生喜欢的，等你进去了，再去思考。但是进去了，你就要马上开始边工作边思考这些基本问题了，因为你又进入了一个新的阶段。 就像，在你还没考入重点高中之前，你没必要纠结到底是上北大还是清华一样，但是等你跨入重点高中那个大门之后，你就真的要结合自身情况，来好好考虑一下这个问题了。"
    },
    {
      "id": 7,
      "title": "关于读书",
      "author": "王川",
      "body": "1/ 人们遇到棘手问题时，直觉反应往往是加大马力继续强攻，把自己搞得悲壮不已，但没啥用。从更高的视角看，大部分路径都是死胡同或者非最佳选择。可行的策略，应当是不带预设立场，不断增加和外界的信息连接，这样尽可能接近甚至参与全球最优解的生成。这实际上就是摩尔定律真正的发展规律。这个话题，可以参见我的老文章 “王川: 为什么摩尔定律一直没死, 但人们还会继续预测摩尔定律要死” 2/ 冥思苦想一些问题，尤其是战略问题，如果觉得没有进展的话，最好的方法是多读书，这相当于自然而然的引入一些新的外在的变量，然后发现想不通的问题有可能在别的地方联通。更好的办法是读一会书，再去打打太极拳，一打拳，大脑一放松，不再专注某个狭隘的角度，很多清奇的想法就冒出来了。 3/ 大部分时间在做执行和重复度比较高的工作的人，没机会接触新人新思想，没时间去向外探索，因此很难获得这种愉悦感，这对身心健康有很大害处。 4/ 读书的快感在于把一件事情搞清楚。如果一个话题你以前百思不得其解，而读了一本书后豁然开朗，这种快感就极为强烈。这个愉悦感是在底层自然产生的，胜过各种补药和虚妄的心灵鸡汤。而一个你已经比较清楚的话题，如果书的内容不能带来更多有效信息，就会觉得枯燥无味。所以，书的价值，部分取决于读者的知识结构。 5/ 知识结构的维度越高，越有可能和有价值的信息联通，产生连贯的逻辑，和那种茅塞顿开的快感。有人说，“知识的增量是其存量的函数 ”。每本好书，都是打开通往新世界的一道门，一扇窗。 6/ 非理性大脑 (limbic system) 有时可以比理性大脑提前预测感知一些趋势。比如有时遇到困难，意识到前面的某个路被堵住了，还没完全想清楚的时候，这种焦虑就已经影响到自己的情绪，让人感到不舒服了。 7/ 反之，如果在读书中有新的发现，意识到未来增加了很多全新的选择，理性大脑还没完全梳理清楚这个逻辑的时候，非理性大脑已经开始庆祝，多巴胺爆表，大脑不由自主地充满喜悦。这是个可以不断重复的，很有意思的现象。 8/ 从自己感兴趣的书开始慢慢读，如果读了五到十分钟还不觉得有趣就放下，也许以后再回头来读。读着读着你就会发现自己的认知慢慢螺旋式上升，像爬山一样，视野慢慢开阔，渐入佳境。读电子书做这种切换，比纸质书方便多了。 9/ 切换并不意味着放弃，而是说先去寻找更有趣，有动力的事去做，以后还可以再回来。很多人爱鼓吹渲染一种悲情壮烈死磕的学习工作精神，并以此互相激励忽悠，这是极为愚蠢的，迟早要把自己给磕死的。这就好似爬山时，坚持要垂直向上攀登，而没有意识到螺旋式慢慢上升，才是普遍现象。再说人的耐心是有限的，生活没有乐趣，天天那么悲壮地死磕有啥意思? 10/ 山上的视角有这么几个好处: 第一，全是原始的未被篡改的数据，尽收眼底。第二，马上可以认出一些关键物体，比如建筑群，公园，湖泊，山丘，商场等等。第三，马上可以知道所有这些不同物体是如何连接的。站的高，视野开阔，底层各个节点之间的关系，连接机制，哪里不通，哪里可通，哪里有什么样的资源，一览无余，尽收眼底，这时再情不自禁地来一句张宗昌老师的“大炮开兮轰他*”，曹孟德老师的“幸甚至哉，歌以咏志”，也就是顺理成章的事情了。 11/ 本质上给人带来愉悦感的不是物理高度，而是高度带来的巨大的视野宽度，所有的事情一览无余，这是在底层很难看清的。但如果眼前有山丘挡住大部分视野，那马上也会很不爽，即使位置很高。 12/ 据传马云老师说过这句话，“登上山顶的人看到的景色都是一样的，只有在山腰上才会有各种各样的观点。” 但是我们对经济，社会还有很多事物的理解宽度和深度，远远不如这种登高望远所获得的视角。 13/ 直到过去十五年, 随着移动互联网，电子书，网络视频，和社交媒体的迅速普及，普通人的信息搜集和处理能力大大提高。 14/ 以读书为例，我的 kindle 上现在有接近一千本电子书，每年购买 200-300 本。普通的纸质书，一个大书架装个两百本就很多了。以前电子书不普及的时候，一年买四五十本就很多了。所以这是五倍的提高。 15/ 电子书可以任何时候，任何地点打开手机或者 iPad，laptop 就可以看, 可以看书的时间比纸质书，至少增加三倍。我可以三秒钟内在书内搜索某个关键词。根本不需要传统纸书的索引。而且索引很多时候是不全的。这个提高是五到十倍。 16/ 我可以查找别人在书上划的重点，自己划的重点。而纸质书根本看不到别人划的重点。 17/ 我可以对书中某个话题同时查询谷歌，维基百科，YouTube，推特，微博，微信公号，交叉验证，补充知识。传统媒体做不到。 18/ 我可以就某个内容写个总结和评论，通过各大社交媒体发布，迅速获得各种反馈，获得更全面真实的视角。传统媒体很难操作，反馈极为缓慢。 19/ 从计算机科学的角度看，这就是电脑的智能化: 更多的内存，零延迟，读写速度更快，读写成本更低，外部连接的网络节点更多，承载更多的新应用，反馈更多更迅速。 20/ 亚马逊上的书约有三千两百万本，电子书一百二十万本 (2014年的数据)。一个普通书店里罗列的书籍，有一万本就不错了。这个差距是一百到三千比一。如果你的信息来源比别人丰富一百倍以上，这是压倒性的优势。省掉到书店里的交通费用和路上的时间，够买和读好多本书了。还有什么别的地方，可在源头上低成本地获得如此压倒性的优势? 21/ 假设绝大部分小说诗歌童话之类的书籍 (fiction)不值得阅读, 这类书占一半。剩下的非小说类别的书籍（non-fiction）六十万本，再假设这里面只有百分之一的书贡献绝大部分价值，那就只需收藏六千本电子书差不多够了。 22/ kindle 的一个好处是可以先提供免费的一两章阅读。一个高效的方法是，先选择你感兴趣的议题，比如说技术史 (technology history), 顺藤摸瓜调出十几本书来，每本书花两三分钟看看第一章，再决定是否有兴趣购买。这样一方面避免浪费，另外强迫自己确实阅读一点内容，而不是自欺欺人，买了后就束之高阁。除了议题外，针对某个作者顺藤摸瓜，读到更多更有趣的内容，或者在读的过程中，发现更多新的有趣的你从来不知道的事情，都是自然而然的收获。 23/ 意识到进一步大幅度提高自己的有效方向，是把每年购书数量加码，提高到一年五百本以上，争取这五百本的选择可以覆盖最优秀的，有代表性的，多样化的书籍。这其实也就是平均每天不到两本。 24/ 多年前在合肥破旧的通宵教室啃一本书，John Jackson 的经典电动力学，一头雾水，啃半天啃不动，对作者恨得咬牙切齿。如果今天给那时的自己出主意，就是赶快放弃，换别的书看。还有当年用 c 编程，搞了半天 malloc 老是搞不定，老出现 segmentation fault， 也是让人暴跳如雷。幸好现在的程序员大多都不用管这些底层细节了。 25/ 与其花时间努力研究如何捏柿子，不如满(虚拟)世界跑，系统地，大规模地，源源不断地获得软柿子来捏。而读书的过程中，一方面会潜移默化地丰富自身知识结构，提升丰富捏柿子的技巧；另一方面会增加自己知道的软柿子的选择。如果一个柿子捏了几分钟捏不动，不要犹豫，换一本书，去找下个软柿子。 26/ 反思过去各种挫折的时候，意识到挫折的本质实际上不是努力不够，人不够聪明，而是信息不足。信息不足的时候，人们往往无法意识到自己真正的短板，在于信息不足！信息不足，选择就很少。选择少，意味着费牛劲试图解决一个完全错误的问题，很长时间没啥进步，内心痛苦而愤怒。但以过去的物质条件，实际上很难突破这种信息不足的困境。而现在一切都变了，信息是海量的廉价的。就等着有心人去开拓。 27/ 没有通过读书读史建立的全局视角和跨越长时间的视角，凭个人经验总结的原因和方法论会有大问题。很多跨越十几年，二十几年或更长的历史经验教训，只能从书里面找到。尤其是那些短期局部，看上特别有道理有诱惑性欺骗性，但长期全局，可能造成重大的甚至毁灭性损失的陷阱。这种教训，如果要靠亲自吃亏去学来，那代价是无法承受的。 28/ 有学者估算人类历史上死去的人和现在还活着的人的比例是十四比一。但是最大的问题是死去的人无法说话，所以那十四分之十三的宝贵经验教训很难不失真地留存，传给后人，这大概是为什么我们很难吸取历史经验教训的主要原因吧。只有在读书读史的过程中，才可以发现一些蛛丝马迹。类似的，爆仓的基金经理，也很少说话，大多悄悄地黯然退去。然后下一波不知天高地厚的新人，又会重复他们的错误。 29/ 反之，有些短期看上去很不起眼，但最终厚积薄发的现象和机会，为什么自己抓不住，这里面有哪些反直觉的逻辑，要看很多书，很多历史案例，多角度，长时间跨度审视，才能抓住本质。而这些道理要靠自己亲身体验，花几十年折腾去悟道，很困难，很缓慢。 30/ 读得越多，越意识到以前自己没有搞清楚，或者感到很模糊困惑的事情，早有前人总结出了各种理论模型，和各类解决方案，马上可以借鉴，拿来就用，非常惬意。而这种认知的提高，又能让自己有更强的能力，理解和洞穿以前没看懂的问题，形成一个良性循环。 31/ 战略优势来自于从不同角度，维度，尺度洞察真相，看到别人没看到的东西。每本好书都是这种工具的积累。有趣的是，你觉得理所当然的事情，而你原来的朋友因为缺乏这种思维工具怎么解释也无法理解，人和人的差距就是这么拉大的。 32/ 阅读量大才能找到软柿子捏，找到正好可以提升自己知识结构，马上有用的东西。否则数量太少，有些内容晦涩或者暂时和自己知识结构不匹配的东西，读起来很困难也不愉快，很容易卡壳和丧失动力. 软柿子常常在想不到的地方出现。所以，开放多样化不带预设立场的信息渠道非常关键。没有预设立场，比有预设立场的人，存在巨大竞争优势。 33/ 人如果一天不读新书接触新思想知识，大脑就会内卷化。这里内卷化可以理解为同样一些想法思绪毫无新意地翻来覆去，浪费能量，人毫无进步，偏执顽固而不自知。一个地方的人如果不向外探索，开辟大量新的物理空间，也会内卷化，大家在红海市场里痛苦地玩零和游戏。 34/ 内卷化世界的人爱装 b, 把一些底层逻辑本来很简单的事情，云山雾海绕来绕去，讳莫如深。外卷化的世界，逻辑简单清晰，干柴烈火，大家都很忙，有很多活要干，有很多新的空间要去探索。 35/ 内卷化的世界，会把各种约束和习惯当成理所当然，而只有在引入外界变量和增量发生巨大改变后，才会意识到当初的习惯和思维，何等低级可笑。对内挖潜是有限的，向外建立新连接引入增量是无限的，甚至指数增长的。 36/ 人的焦虑，本质是是来自低维度的认知，以为某些障碍自己一定必须要努力跨过去，然后心急火燎。而多读大量多学科的书籍，可以不断低成本地发现新的维度，让自己轻松绕过一些单维度上的障碍。这个过程没有上限。 37/ 长期在不同维度上收集各类信息，当积累的信息密度过了一个临界点，就有大概率把原来不相干的事情联系在一起，对复杂真相形成一个全面的整体化的认识，恍然大悟。否则很容易被他人精心设计的圈套或假象，所长期误导而不自知。这本质跟魔术师的表演是一个道理，魔术师只把某个角度的现象暴露给观众，观众的注意力被引导而不自知，然后盲目相信魔术师的法力无边，自愿成为被收割的对象。 38/ 每每识破这类魔法和假象后，常发”禽兽之变诈几何哉，徒增笑耳”的感叹。同时又意识到，还有多少自己仍被蒙在鼓里的假象和错觉，等待着被看穿被识破。 39/ 美国发明家，图灵奖获得者 Douglas Engelbart 有名言：“我们变得更好之后，我们就能更好地变得更好。而当我们能更好地变得更好之后，我们也就能更快地变得更好。” 40/ 而现在，再也没有比一年读五百本书更实用的方式，让自己低成本地，更快更好地，每天高潮迭起地，变得更好了。 41/ 而这个发展趋势绝不止步于此，可以想象以后脑联网发展成功，几分钟内可以把整个美国国会图书馆的藏书装入大脑内存，并且多个大脑在开放网络上互联，那时再来看现代人的学习方式，也许就和人看草履虫是一个感觉。"
    },
    {
      "title": "很不喜欢麻烦别人是好事还是坏事？",
      "body": "我一直觉得，凡事尽量不给别人添麻烦是一种美德。\n但是凡事也都需要辩证地看。\n比如你要学会区分，你觉得可能会麻烦别人 和 别人觉得有被麻烦到 之间的区别。\n一些到哪里都惹人嫌的人，就是错误地把 别人觉得麻烦的事儿 都默认成了 别人不觉得麻烦，所以屁大点事儿，都要去麻烦别人，实际上就是他自己懒省事不想做，或者不想花钱，把别人当冤大头，当免费劳动力使。\n比如很多学法律或当律师的人都会收到很多亲戚或朋友的各种咨询，他们什么事儿都想要你帮忙把把关，给个意见，理由就是你是专业的，你做这事儿都是顺手做的，不费什么事儿，他们当然也不会给你报酬，甚至很多时候连声谢谢也不会跟你说，因为他们觉得你帮他们做这些，都是理所当然的。\n类似的还有当设计师的人会被各种亲戚朋友要求帮忙设计各种东西或者帮忙免费修个图，学计算机的会被各种亲戚朋友要求帮忙修电脑，处理各种软件问题，要你帮忙破解密码等等。\n这些人呢，不仅不会给你报酬，不会说声谢谢，你要是回复慢了，他们都会生气，你如果敢拒绝，他们分分钟就会破口大骂，当场跟你断绝关系。\n这种人就是典型的，只要他自己不觉得麻烦，那麻烦的就永远是别人，这样的人最后也只会落得一个没朋友的结局。\n而有些人则会把很多 别人其实不觉得麻烦的事儿 全部都默认为 别人会觉得麻烦，从而什么事儿都自己去做，哪怕这件事自己去做会很费劲，也不想去麻烦别人，请求帮助。\n这样就会既疏远了与别人的关系，也无形中给自己添了不少烦恼。\n你要知道，一些事儿，你去做可能会非常难，会耗费你很大的精力，但这事儿，有可能别人很容易就能搞定，他们也很乐意去帮你，并不觉得麻烦。\n反过来，一些别人做起来很难的事儿，你可能很容易就搞定了。\n所以，你和别人之间其实是存在着互相帮助，互相扶持，共同进步的需要的。\n很多朋友之间的关系也是靠这样的人情往来一步步增进的。\n如果你所有事都尽量不麻烦别人，那就可能会错过很多机会，也会错过很多可以互相帮助的好朋友。\n但一件事情，别人究竟觉得麻烦不麻烦，其实是很难判断的，所以，行之有效的方法就是，如果你遇到了一件自己可能搞不定的事情，先不要纠结要不要求助别人，而是要先问一下别人，能不能帮忙，顺便要说清楚，如果能轻松搞定，就去做，如果别人做也很难，那就不要勉强了，自己再想办法。\n不要觉得这样问，别人会不好意思，或者觉得别人会被冒犯到。\n人都是需要慢慢磨合的，同一个人，你接触个一两次，就知道别人是否觉得麻烦的边界在哪里了，这样长此以往，你们之间就能形成默契，建立真正的互帮互助，互惠互利的关系了。\n",
      "author": "The Ninja",
      "id": 8
    }
  ]
}